Hey all, I got the same issue with the `CSIDriver`, I upgraded from `1.9.0` to `2.0.3` and still have this issue at `2.1.1`. If you need more information or any commands I can run, please let me know, I got quite some time at hand.

the error in `tf apply`:

```bash
module.kube-hetzner.null_resource.kustomization (remote-exec): The CSIDriver "csi.hetzner.cloud" is invalid: spec.fsGroupPolicy: Invalid value: "File": field is immutable
╷
│ Error: remote-exec provisioner error
│
│   with module.kube-hetzner.null_resource.kustomization,
│   on .terraform/modules/kube-hetzner/init.tf line 285, in resource "null_resource" "kustomization":
│  285:   provisioner "remote-exec" {
│
│ error executing "/tmp/terraform_1184139556.sh": Process exited with status 1
```

The `tf plan` (without the initialization/refresh stuff)

```bash
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.kube-hetzner.data.hcloud_load_balancer.cluster[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "hcloud_load_balancer" "cluster" {
      + algorithm          = (known after apply)
      + delete_protection  = (known after apply)
      + id                 = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + labels             = (known after apply)
      + load_balancer_type = (known after apply)
      + location           = (known after apply)
      + name               = "k3s-eu"
      + network_id         = (known after apply)
      + network_ip         = (known after apply)
      + network_zone       = (known after apply)
      + service            = (known after apply)
      + target             = (known after apply)
    }

  # module.kube-hetzner.data.remote_file.kustomization_backup will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "remote_file" "kustomization_backup" {
      + content     = (known after apply)
      + group       = (known after apply)
      + id          = (known after apply)
      + owner       = (known after apply)
      + path        = "/var/post_install/kustomization.yaml"
      + permissions = (known after apply)

      + conn {
          + agent       = (sensitive value)
          + host        = "CENSORED"
          + port        = 2222
          + private_key = (sensitive value)
          + user        = "root"
        }
    }

  # module.kube-hetzner.local_file.kustomization_backup[0] will be created
  + resource "local_file" "kustomization_backup" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "k3s-eu_kustomization_backup.yaml"
      + id                   = (known after apply)
    }

  # module.kube-hetzner.null_resource.kustomization is tainted, so must be replaced
-/+ resource "null_resource" "kustomization" {
      ~ id       = "7377421702092477722" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```